tutorial/0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

Uref                 1.9;
Zref                 18;
zDir                 (0 0 1);
flowDir              (1 0 0);
z0                   uniform 2;
zGround              uniform 0;

// ************************************************************************* //
