tutorial/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantHumidityPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         21600;

deltaT          10;

writeControl    adjustableRunTime;

writeInterval   300;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           60;

maxDeltaT 	60;

functions
{
  
}
libs ("libatmosphericModels.so");

// ************************************************************************* //#includeFunc patchAverage(patch = INLET, fields = (p U))//
